### Урок 2
Numpy

In [48]:
import numpy as np

#### Задание 1
Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [7]:
a = np.array([[1, 6], [2, 8], [3, 11], [3, 10], [1, 7]])
a

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [9]:
mean_a = a.mean(axis=0)
mean_a

array([2. , 8.4])

#### Задание 2
Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [39]:
a_centered = np.transpose(np.vstack((a[:,0]-mean_a[0], a[:,1]-mean_a[1])))
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

#### Задание 3
Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [46]:
a_centered_sp = a_centered[:, 0] @ a_centered[:, 1]
a_centered_sp_N = a_centered_sp / (a.shape[0]-1)
a_centered_sp_N

2.0

#### Задание 4**
Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся в массиве “а”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной оценкой ковариации.
В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером 2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

In [52]:
b=np.cov(a.T)
b[0, 1]

2.0

Pandas

In [1]:
import pandas as pd

#### Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [14]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({
    'author_id':[1, 1, 1, 2, 2, 3, 3], 
    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price':[450, 300, 350, 500, 450, 370, 290]
})

In [15]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [16]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [12]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')

In [17]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [19]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

#### Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [35]:
groupby = authors_price.groupby("author_name")
authors_stat = pd.merge(
    pd.merge(groupby.agg({"price": "min"}), groupby.agg({"price": "max"}), on='author_name', how='inner'), 
    groupby.agg({"price": "mean"}), on='author_name', how='inner') 


authors_stat

             price_x  price_y       price
author_name
Островский       290      370  330.000000
Тургенев         300      450  366.666667
Чехов            450      500  475.000000

In [36]:
authors_stat = authors_stat.rename(columns={'price_x': 'price_min', 'price_y': 'price_max', 'price': 'price_mean'})
authors_stat

             price_min  price_max  price_mean
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [37]:
authors_stat.describe()

        price_min   price_max  price_mean
count    3.000000    3.000000    3.000000
mean   346.666667  440.000000  390.555556
std     89.628864   65.574385   75.394027
min    290.000000  370.000000  330.000000
25%    295.000000  410.000000  348.333333
50%    300.000000  450.000000  366.666667
75%    375.000000  475.000000  420.833333
max    450.000000  500.000000  475.000000

#### Задание 5**
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [43]:
authors_price['type_cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price type_cover
0          1    Тургенев           Отцы и дети    450    твердая
1          1    Тургенев                 Рудин    300     мягкая
2          1    Тургенев     Дворянское гнездо    350     мягкая
3          2       Чехов      Толстый и тонкий    500    твердая
4          2       Чехов       Дама с собачкой    450    твердая
5          3  Островский                 Гроза    370     мягкая
6          3  Островский  Таланты и поклонники    290     мягкая

In [45]:
? pd.pivot_table

In [52]:
book_info = pd.pivot_table(authors_price, index='author_name', columns='type_cover', values='price', aggfunc=np.sum)
book_info

type_cover   мягкая  твердая
author_name
Островский    660.0      NaN
Тургенев      650.0    450.0
Чехов           NaN    950.0

In [54]:
book_info["мягкая"] = book_info["мягкая"].fillna(0)
book_info["твердая"] = book_info["твердая"].fillna(0)
book_info

type_cover   мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [55]:
book_info.to_pickle("book_info.pkl")

In [56]:
book_info2 = pd.read_pickle("book_info.pkl")

In [57]:
book_info == book_info2

type_cover   мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True